docs/01-db-performance-laptop/summary-mysql-5.7.14-win64-physical.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api2/orders/ID,24592,9,2,2480,"24,26","0,000%","271,34802","132,10","34,74","498,5"
POST /api2/orders,16658,14,6,2450,"37,18","0,012%","183,73335","31,92","165,20","177,9"
GET /api2/customers/ID,24658,8,1,2757,"26,00","0,012%","271,98023","77,61","35,83","292,2"
GET /api2/products/ID,24784,8,1,2721,"25,96","0,016%","273,35495","71,59","35,74","268,2"
POST /api/products,945,8,3,210,"11,81","0,106%","10,43115","1,85","2,78","181,7"
POST /api/customers,906,8,2,127,"9,69","0,000%","10,01238","1,76","2,82","180,0"
TOTAL,92543,9,1,2757,"27,82","0,011%","1020,66859","316,76","277,07","317,8"