docs/summary-pgsql-9.4.14-alpine.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api2/products/ID,7311,15,3,96,"7,00","0,014%","117,78447","30,85","15,40","268,2"
GET /api2/customers/ID,7122,15,3,86,"6,94","0,028%","114,72479","32,78","15,11","292,6"
POST /api2/orders,4882,48,15,238,"20,53","0,082%","78,57465","9,52","70,60","124,1"
GET /api2/orders/ID,7257,19,4,110,"8,48","0,028%","116,94276","56,92","14,97","498,4"
POST /api/customers,278,18,9,84,"10,88","0,000%","4,49380","0,54","1,26","122,0"
POST /api/products,264,18,7,75,"10,11","0,000%","4,37695","0,52","1,17","122,0"
TOTAL,27114,22,3,238,"16,58","0,033%","436,38646","130,98","118,42","307,3"