docs/summary-pgsql-9.4.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api2/orders/ID,2389,27,4,88,"11,45","0,042%","71,66212","9,81","9,17","140,2"
GET /api2/customers/ID,2363,26,3,109,"10,95","0,127%","70,94392","20,44","9,34","295,0"
GET /api2/products/ID,2435,26,7,86,"10,83","0,082%","73,06607","10,42","9,55","146,1"
POST /api2/orders,1620,83,12,252,"31,05","0,247%","48,42760","6,07","43,44","128,4"
POST /api/customers,91,30,9,76,"13,47","0,000%","2,73948","0,33","0,77","122,0"
POST /api/products,89,26,11,55,"10,34","0,000%","2,74446","0,33","0,73","122,0"
TOTAL,8987,36,3,252,"27,57","0,111%","268,60542","47,21","72,85","180,0"